using System;

/*
 * Запросить у пользователя минимальную и максимальную температуру за сутки и вывести среднесуточную температуру.
 * Запросить у пользователя порядковый номер текущего месяца и вывести его название.
 * Определить, является ли введённое пользователем число чётным.
 * 
 */
namespace Lesson2
{
    class Program
    {
        static void Main(string[] args)
        {
            //Блок переменных глобальных
            int TemperatureMin, TemperatureMax, TemperatureAve;           


            //Запрашиваем у пользователя минимальную температуру за сутки
            Console.WriteLine("Введите минимальную температуру за сутки");
            //Присваиваем переменной
            
        }
    }
}
